Autodesk.Revit.DB.LinkLoadResult.GetLinkLoadResult(Autodesk.Revit.DB.ExternalResourceReference)
Searches this LinkLoadResult and all nested LinkLoadResults for the
load operation results of a specified ExternalResourceReference.
Remarks:
In the case where there are multiple matches, then the LinkLoadResult closest
to the top-level link will be returned.  For example, if you are searching for C,
starting with a top-level link, A, which links B and C, while B also links C directly,
then the load results for C as a direct sub-link of A will be returned.  It is expected
that the LinkLoadResults for all instances of C in the nested load result tree will be
the same.  However, if you need to inspect each individual result, the LinkLoadResult
class does provide methods to navigate the tree.
NULL is returned if a match for the ExternalResourceReference cannot be found.
matchExtResRef:
An ExternalResourceReference whose LinkLoadResults are contained in this object.
Returns:
A LinkLoadResult object with the load results for the specified ExternalResourceReference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.LinkLoadResult.#ctor(Autodesk.Revit.DB.LinkLoadResult)
Constructs a new copy of the input LinkLoadResult object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013